Revit 2027 API
BuiltInFailures.HostedWallAssociationFailures.AssociationFailed Property
 Associate hosted wall to host failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AssociationFailed { get; }
Public Shared ReadOnly Property AssociationFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AssociationFailed {
	FailureDefinitionId^ get ();
}
static member AssociationFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.HostedWallAssociationFailures Class
Autodesk.Revit.DB Namespace